Repository: maxjaglak/kcal_counter_flutter
Catalog: l10n_translations/app_*.arb
Languages: pl

# appTitle
source: Kcal counter
pl: Licznik Kalorii

# commonYes
source: Yes
pl: Tak

# commonNo
source: No
pl: Nie

# commonCancel
source: Cancel
pl: Anuluj

source: Add consumption
pl: Dodaj wpis

# addFromList
source: Add from the list
pl: Dodaj z listy

source: Change
pl: Zmień

source: Save
pl: Zapisz

source: Amount
pl: Ilość

# chooseDots
source: Choose...
pl: Wybierz...

# navTabToday
source: Today
pl: Dzisiaj

# navTabHistory
source: History
pl: Historia

# navTabLibrary
source: Library
pl: Tabela

# navTabSettings
source: Settings
pl: Ustawienia

# libraryDeleteQuestionTitle
source: Delete?
pl: Usunąć?

# libraryDeleteQuestionContent
source: Do you want to delete: {name}?
pl: Czy na pewno chcesz usunąć: {name}?

# editAddNewEntry
source: Add new entry
pl: Dodaj nowy wpis

# editEdit
source: Edit
pl: Edytuj

# editLabelName
source: Name
pl: Nazwa

# editLabelUnitName
source: Unit name
pl: Nazwa jednostki

# editLabelHowManyUnitsInEntry
source: How many units in this description? (ex. 100g)
pl: W ilu jednostkach są te wartości? (np. 100g)

# editLabelKcalInEntry
source: Kcals in entry
pl: Kcal w porcji

# editLabelCarbsInEntry
source: Carbs in entry
pl: Węglowodany w porcji

# editLabelFatInEntry
source: Fat in entry
pl: Tłuszcz w porcji

# editLabelProteinInEntry
source: Proteins in entry
pl: Białko w porcji

# editLabelFavourite
source: Favourite (higher in the results)
pl: Ulubione (wyżej na liście)

# editValidationNameCannotBeEmpty
source: Name field cannot be empty!
pl: Pole nazwa nie może być puste

# editValidationFieldCannotBeEmpty
source: Field cannot be empty!
pl: Pole nie może być puste

# editValidationUnitCountMustContainInteger
source: Field unit number must contain positive integer!
pl: Pole ilość jednostek nie może być puste

# editValidationKcalsMustContainInteger
source: Kcal field must contain positive integer!
pl: Pole Kcal musi zawierać wartość dodatnią

# editValidationCarbsCountMustContainInteger
source: Carbs have to be positive integer or zero!
pl: Pole węglowodany musi zawierać zero albo liczbę dodatnią

# editValidationFatCountMustContainInteger
source: Fat must be positive integer or zero!
pl: Pole tłuszcze musi zawierać zero albo liczbę dodatnią

# editValidationProteinCountMustContainInteger
source: Proteins have to be positive integer or zero!
pl: Pole białko musi zawierać zero albo liczbę dodatnią

# settingsLabelClearLibrary
source: Clear library (calories table)
pl: Wyczyść tabelę produktów

# settingsLabelExportLibraryToCsv
source: Export library to CSV
pl: Exportuj tabelę produktów do CSV

# settingsLabelImportLibraryFromCsv
source: Import CSV file to library
pl: Importuj tabelę produktów z CSV

# settingsLabelHowToBuildCsvFile
source: Hot to build CSV file
pl: Jak zbudować plik CSV z tabelą produktów?

# settingsLabelLicense
source: License
pl: Licencja

# settingsConfirmClearLibraryTitle
source: Do you really want to clean library?
pl: Czy na pewno wyczyścić tabelę kalorii?

# settingsConfirmClearLibraryContent
source: Do you really want to clean all data in the library? THIS OPERATION CANNOT BE REVERTED!
pl: Czy na pewno usunąć wszystkie wpisy z tabeli kalorii? TEJ OPERACJI NIE DA SIĘ ODWRÓCIĆ

# settingsMessageImportFinished
source: Import finished
pl: Import zakończony

# settingsMessageLibraryDeleted
source: Library has been deleted
pl: Usunięto

# consumptionNoElements
source: No elements
pl: Brak elementów

# summaryCarbsCount
source: Carbs: {count} g
pl: Węglowodany: {count} g

# summaryFatCount
source: Fat: {count} g
pl: Tłuszcz: {count} g

# summaryProteinCount
source: Protein: {count} g
pl: Białko: {count} g

# summaryItemsCount
source: Total items: {count}
pl: Ilość: {count}

# summaryLabelEmpty
source: It's empty here...
pl: Pusto tutaj...

# summaryLabelStartNewDay
source: Start a new day :)
pl: Zacznij nowy dzień :)

# summaryConfirmDeleteTitle
source: Delete?
pl: Usunąć?

# summaryConfirmDeleteContent
source: Do you want to delete {name}?
pl: Czy na pewno chcesz usunąć {name}?

source: Today
pl: Dzisiaj

source: Yesterday
pl: Wczoraj

# csvTutorialResourceName
source: assets/html/csv_tutorial_en.html
pl: assets/html/csv_tutorial_pl.html

# csvTutorialResourceNameAndroid
source: assets/html/csv_tutorial_en_android.html
pl: assets/html/csv_tutorial_pl_android.html
